{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "119",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all people that were born in Vienna and died in Berlin.",
          "keywords": "people, born, Vienna, die, Berlin"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> .  ?uri <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Michael_Meinecke"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Eduard_von_Winterstein"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Michael_von_Newlinsky"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Steffie_Spira"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Johann_Strauss_III"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Erik_Jan_Hanussen"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Therese_Gr%C3%BCnbaum"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Grete_von_Zieritz"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hilde_Krber"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hugo_Flink"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Karl_Etlinger"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Richard_Thurnwald"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Adolf_Klein"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hilde_K%C3%B6rber"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Alfred_Halm"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Karl_Hellmer"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Therese_Grnbaum"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "141",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Who founded Intel?",
          "keywords": "Intel, founded"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Intel> <http://dbpedia.org/ontology/foundedBy> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Robert_Noyce"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Gordon_Moore"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "15",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Who created Goofy?",
          "keywords": "created, Goofy"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Walt_Disney"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Del_Connell"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Paul_Murry"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "157",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Apollo 14 astronauts.",
          "keywords": "astronaut, Apollo 14"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Alan_Shepard"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Edgar_Mitchell"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Stuart_Roosa"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "184",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Who created Batman?",
          "keywords": "Batman, creator"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Bill_Finger"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Bob_Kane"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "89",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all soccer clubs in the Premier League.",
          "keywords": "Premier League, soccer club"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> .  ?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Everton_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Newcastle_United_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Queens_Park_Rangers_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Southampton_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tottenham_Hotspur_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/West_Ham_United_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Arsenal_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Chelsea_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Aston_Villa_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Liverpool_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Manchester_United_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/West_Bromwich_Albion_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Melchester_Rovers"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Holywood_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Burnley_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Crystal_Palace_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hull_City_A.F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Leicester_City_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Manchester_City_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Stoke_City_F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Sunderland_A.F.C."
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Swansea_City_A.F.C."
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "230",
      "answertype": "date",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "When is Halloween?",
          "keywords": "date, Halloween"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "date"
            ]
          },
          "results": {
            "bindings": [
              {
                "date": {
                  "type": "literal",
                  "value": "--10-31"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "219",
      "answertype": "boolean",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Is Cola a beverage?",
          "keywords": "Cola, beverage"
        }
      ],
      "query": {
        "sparql": "ASK WHERE {  <http://dbpedia.org/resource/Cola> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage> . } "
      },
      "answers": [
        {
          "head": {
          },
          "boolean": false
        }
      ]
    },
    {
      "id": "260",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show a list of soccer clubs that play in the Bundesliga.",
          "keywords": "soccer clubs, play, Bundesliga"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> .  ?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/SV_Werder_Bremen"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hertha_BSC"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hamburger_SV"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/1._FSV_Mainz_05"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Eintracht_Frankfurt"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/SC_Freiburg"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/SC_Paderborn_07"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/VfB_Stuttgart"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/VfL_Wolfsburg"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/FC_Augsburg"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/TSG_1899_Hoffenheim"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Bayer_04_Leverkusen"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Borussia_Dortmund"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/FC_Bayern_Munich"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/FC_Schalke_04"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Hannover_96"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "319",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the currency of China.",
          "keywords": "currency, China"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Renminbi"
                }
              }
            ]
          }
        }
      ]
    }
  ]
}